giopde1ste/dsplab/software/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32412G-Discovery/STM32412gDiscovery.cpp
/*!
@file
Implementatie van de c++ schil voor gebruik van de STM32412g Discovery kit.
@version $Rev: 4028 $
@author $Author: ewout $

@copyright Copyright 2017-2018 Hogeschool van Arnhem en Nijmegen, ir drs E.J Boks

$URL: http://svn.hanese.nl/docenten/svn/ewout/vakken/algemeen/software/STM32/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32412G-Discovery/STM32412gDiscovery.cpp $
$Id: STM32412gDiscovery.cpp 4028 2020-11-27 16:11:57Z ewout $
************************************************************************/

#include <STM32412gDiscovery.h>
#include <algdef.h>

#include <assert.h>
#include <diskio.h>
#include "stm32412g_discovery_qspi.h"
#include "stm32412g_discovery_eeprom.h"


#ifndef HAL_RTC_MODULE_ENABLED
#error "HAL_RTC_MODULE_ENABLED moet aan staan voor dit BSP."
#endif

STM32412gDiscovery::STM32412gDiscovery(const UInt32 freq)
{
	
	/* STM32F4xx HAL library initialization:
       - Configure the Flash prefetch
       - Systick timer is configured by default as source of time base, but user
         can eventually implement his proper time base source (a general purpose
         timer for example or other time source), keeping in mind that Time base
         duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and
         handled in milliseconds rtosBasisDSB.
       - Set NVIC Group Priority to 4
       - Low Level Initialization
     */
	/* Configure Flash prefetch, Instruction cache, Data cache */
#if (INSTRUCTION_CACHE_ENABLE != 0U)
	__HAL_FLASH_INSTRUCTION_CACHE_ENABLE();
#endif /* INSTRUCTION_CACHE_ENABLE */

#if (DATA_CACHE_ENABLE != 0U)
	__HAL_FLASH_DATA_CACHE_ENABLE();
#endif /* DATA_CACHE_ENABLE */

#if (PREFETCH_ENABLE != 0U)
	__HAL_FLASH_PREFETCH_BUFFER_ENABLE();
#endif /* PREFETCH_ENABLE */
	
	/* Set Interrupt Group Priority */
	HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
	
	/* Use TIM14 as time base source and configure 1ms tick (default clock after Reset is HSI) */
	HAL_InitTick(TICK_INT_PRIORITY);
	
	SYSCLKConfig_STOP(freq);
	
	/** Enables the Clock Security System */
	HAL_RCC_EnableCSS();
	
	enableSWO(8);  /* 24/8 = 3 MHz output */
	
	/* tijdens slaap en stop moet clk voor debug blijven draaien */
#ifndef NDEBUG
	HAL_DBGMCU_EnableDBGSleepMode();
	HAL_DBGMCU_EnableDBGStandbyMode();
#endif
	
	/* initialiseer de peripheral drivers */
	gpioInit();
	ledsInit();
	
	qspiInit();
// doet het niet --> uitzoeken sdioInit();
	rngInit();
	rtcInit();
}



TIM_HandleTypeDef STM32412gDiscovery::Tim13Handle;

void STM32412gDiscovery::knipperBlauwLED(const STM32412gDiscovery::KnipperLEDStand stand) const
{
	assert(stand<KnipperLEDStand::Laatste);
	
	switch(stand)
	{
		case KnipperLEDStand::Stop:
		{
			BSP_LED_Off(LED4);
			HAL_NVIC_DisableIRQ(TIM8_UP_TIM13_IRQn);
			HAL_TIM_Base_Stop_IT(&Tim13Handle);
		}
			break;
		case KnipperLEDStand::PermanentAan:
		{
			BSP_LED_On(LED4);
			HAL_NVIC_DisableIRQ(TIM8_UP_TIM13_IRQn);
			HAL_TIM_Base_Stop_IT(&Tim13Handle);
		}
			break;
		
		default:
		{
			static const UInt16 knipperStanden[] =
				{
					0,
					0,
					60000,   /* 96E6/(3200*60000) = 1/2 Hz */
					30000,   /* 1 Hz */
					15000,   /* 2 Hz */
					5000     /* 6 Hz */
				};
			
			auto &init = Tim13Handle.Init;
			init.Period = knipperStanden[static_cast<Teller>(stand)];
			init.Prescaler = 3200;
			init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
			init.CounterMode = TIM_COUNTERMODE_UP;
			if (HAL_TIM_Base_Init(&Tim13Handle) != HAL_OK)
			{
				/* Initialization Error */
				StopHier();
			} else
			{
				HAL_NVIC_SetPriority(TIM8_UP_TIM13_IRQn, 14, 0);
				
				HAL_TIM_Base_Start_IT(&Tim13Handle);
				HAL_NVIC_EnableIRQ(TIM8_UP_TIM13_IRQn);
			}
		}
	}
}

void STM32412gDiscovery::setLED(const LEDKleur kleur,
                                const Schakelaar stand) const
{
	assert(kleur < LEDKleur::LaatsteKleur);
	
	static const Led_TypeDef stLEDs[4] = { LED_GREEN,LED_ORANGE,LED_RED,LED_BLUE };
	
	/* Een echte lambda funktie !! */
	auto schakelFunk = [] (const LEDKleur lkleur,const Schakelaar s)
	{
		const auto k = static_cast<Teller>(lkleur);
		switch(s)
		{
			case Schakelaar::Uit:
				BSP_LED_Off(stLEDs[k]);
				break;
			case Schakelaar::Aan:
				BSP_LED_On(stLEDs[k]);
				break;
			case Schakelaar::Om:
				BSP_LED_Toggle(stLEDs[k]);
				break;
			default:
				StopHier();
				break;
		}
	};
	
	if (kleur < LEDKleur::AllColours)
		schakelFunk(kleur,stand);
	else
	{
		static const LEDKleur kleuren[] = { LEDKleur::Green,
		                                    LEDKleur::Orange,
		                                    LEDKleur::Red,
		                                    LEDKleur::Blue };
		
		for (auto k : kleuren)
			schakelFunk(k,stand);
		
	}
}

STM32412gDiscovery::KnopID STM32412gDiscovery::wachtOpEenKnop(const bool stopMode)
{
	resetKnop();
	
	wachtFunktie(stopMode);

#ifndef FreeRTOSGebruikt
	const auto k = geefKnopStand();
	return(k);
#else
	KnopID knop = KnopID ::Onbekend;
	
	for (Teller k=1;k<5;k++)
	{
		CountingSemaphore &sem = STM32412gDiscovery::knopSems[k];
		if (true == sem.Take(0))
		{
			knop = static_cast<STM32412gDiscovery::KnopID>(k);
			break;
		}
	}
	return(knop);
#endif
}


void STM32412gDiscovery::wachtOpKnop(const KnopID knopStand, const bool stopMode)
{
	resetKnop();
	
	bool magGaan=false;
	
	do
	{
		wachtFunktie(stopMode);

#ifndef FreeRTOSGebruikt
		const auto k = geefKnopStand();
		magGaan =  ((knopStand == k) ? true : false);
#else
		const auto index = static_cast<Teller>(knopStand);
		knopSems[index].Take();
		magGaan = true;
#endif
	} while (false == magGaan);
	
}

Schakelaar STM32412gDiscovery::geefKnopStand(const STM32412gDiscovery::KnopID knopStand) const
{
	/* knoppen op :
	 * centrum - pa0  --> EXTI0
	 * links   - pf15 --> EXTI15
	 * rechts  - pf14 --> EXTI14
	 * boven   - pg0  --> EXTI0
	 * onder   - pg1  --> EXTI1  */
	
	const JOYState_TypeDef js = BSP_JOY_GetState();
	const auto knopvert = static_cast<STM32412gDiscovery::KnopID>(js);
	
	return((knopStand == knopvert) ? Schakelaar::Aan : Schakelaar::Uit);
}

