giopde1ste/dsplab/software/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32412G-Discovery/STM32412gDiscovery.cpp
void STM32412gDiscovery::wachtFunktie(const bool stopMode)
{
	/* stop de systick en andere timer interrupts , deze maakt anders de wfi ongedaan */
	HAL_NVIC_DisableIRQ(TIM8_TRG_COM_TIM14_IRQn);
	schakelSysTick(Schakelaar::Uit);
	
	if (true == stopMode)
	{
		HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON,PWR_STOPENTRY_WFI);
		
		/* STM32 gaat verder na knop interrupt */
		SYSCLKConfig_STOP(96);  /* breng PLL en HSE weer tot leven */
	}
	else  /* wacht op interrupt */
	{
		slaapMode();
	}
	HAL_NVIC_EnableIRQ(TIM8_TRG_COM_TIM14_IRQn);
	schakelSysTick(Schakelaar::Aan);
}


TIM_HandleTypeDef STM32412gDiscovery::Tim12Handle;

void STM32412gDiscovery::wachtFunktie(const unsigned short msecs,
                                      const bool slaap) const
{
	__HAL_RCC_TIM12_CLK_ENABLE();
	Tim12Handle.Instance = TIM12;
	
	Tim12Handle.Init.Period        = 1000*msecs;
	Tim12Handle.Init.Prescaler     = 9600;
	Tim12Handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	Tim12Handle.Init.CounterMode   = TIM_COUNTERMODE_UP;
	if(HAL_TIM_Base_Init(&Tim12Handle) != HAL_OK)
	{
		/* Initialization Error */
		StopHier();
	}
	else
	{
		HAL_NVIC_SetPriority(TIM8_BRK_TIM12_IRQn, 14, 0);
		
		HAL_TIM_Base_Start_IT(&Tim12Handle);
		HAL_NVIC_EnableIRQ(TIM8_BRK_TIM12_IRQn);
	}
}

bool STM32412gDiscovery::timer2Afgelopen=false;

void STM32412gDiscovery::timer2IsAfgelopen()
{
	timer2Afgelopen=true;
}

#ifndef FreeRTOSGebruikt
STM32412gDiscovery::KnopID STM32412gDiscovery::knop=KnopID::Onbekend;
#endif
void STM32412gDiscovery::resetKnop()
{
#ifndef FreeRTOSGebruikt
	knop=KnopID::Onbekend;
#endif
}

void STM32412gDiscovery::slaapMode() const
{
	/* This option is used to ensure that store operations are completed */
#if defined ( __CC_ARM   )
	__force_stores();
#endif
	/* Request Wait For Interrupt */
	asm volatile ("wfi");
	//__WFI();
}

/* ##################################    Debug Output  function  ############################################ */

#define ITM_ENA (*(volatile unsigned int*)0xE0000E00) // ITM Enable
#define ITM_TPR (*(volatile unsigned int*)0xE0000E40) // Trace Privilege Register
#define ITM_TCR (*(volatile unsigned int*)0xE0000E80) // ITM Trace Control Reg.
#define ITM_LSR (*(volatile unsigned int*)0xE0000FB0) // ITM Lock Status Register
#define DHCSR (*(volatile unsigned int*)0xE000EDF0) // Debug register
#define DEMCR (*(volatile unsigned int*)0xE000EDFC) // Debug register
#define TPIU_ACPR (*(volatile unsigned int*)0xE0040010) // Async Clock + prescaler register
#define TPIU_SPPR (*(volatile unsigned int*)0xE00400F0) // Selected Pin Protocol Register
#define DWT_CTRL (*(volatile unsigned int*)0xE0001000) // DWT Control Register
#define FFCR (*(volatile unsigned int*)0xE0040304) // Formatter and flush
// Control Register
//const UInt32 CortexM3Processor::_ITMPort = 0; // The stimulus port from which SWO data is received and displayed.
//const UInt32 CortexM3Processor::TargetDiv = 1;// Has to be calculated according to the CPU speed and the output baud rate
void STM32412gDiscovery::enableSWO(const UInt32 targetDiv,const UInt32 itmPort)
{

/* code is afkomstig van Segger J-link handleiding pdf,
 * bladzijde 74.
 */
	
	UInt32 StimulusRegs = ITM_ENA & (~(1 << itmPort));
//
// Enable access to SWO registers
//
	DEMCR |= (1 << 24);
	ITM_LSR = 0xC5ACCE55;
//
// Initially disable ITM and stimulus port
// To make sure that nothing is transferred via SWO
// when changing the SWO prescaler etc.
//
	ITM_ENA = StimulusRegs; // Disable ITM stimulus port
	ITM_TCR = 0; // Disable ITM
//
// Initialize SWO (prescaler, etc.)
//
	TPIU_SPPR = 0x00000002; // Select NRZ mode
	TPIU_ACPR = targetDiv - 1; // Example: 72/48 = 1,5 MHz
	ITM_TPR = 0x00000000;
	DWT_CTRL = 0x400003FE;
	FFCR = 0x00000100;
//
// Enable ITM and stimulus port
//
	ITM_TCR = 0x1000D; // Enable ITM
	ITM_ENA = StimulusRegs | (1 << itmPort); // Enable ITM stimulus port
	
}


UInt32 STM32412gDiscovery::ITMPrint(const UInt32 ch)
{
	return(::ITM_SendChar(ch));
}

void STM32412gDiscovery::ITMPrint(char const * const buffer)
{
	const char *bufPtr = buffer;
	char teken;
	
	do
	{
		ITMPrint(teken = *(bufPtr++));
	} while(teken != '\0') ;
}


/* wordt aangeroepen in de EXTI0 IRQ handler */
#ifndef FreeRTOSGebruikt
STM32412gDiscovery::KnopID STM32412gDiscovery::knopGedrukt(const KnopID id)
{
	return(knop = id);
}

STM32412gDiscovery::KnopID STM32412gDiscovery::geefKnopStand() const
{
	return(knop);
}
#endif

/**
 * @brief  Configures system clock after wake-up from STOP: enable HSE, PLL
 *         and select PLL as system clock source.
 * @param  None
 * @retval None
 */
void STM32412gDiscovery::SYSCLKConfig_STOP(const UInt32 freq)
{
	assert(freq <= 100);
	
	/* 8 MHz klok in uit ST-Link, 96 MHz SysClk */
	RCC_OscInitTypeDef RCC_OscInitStruct;
	
	/**Configure the main internal regulator output voltage
	*/
	__HAL_RCC_PWR_CLK_ENABLE();
	
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
	
	/**Initializes the CPU, AHB and APB busses clocks
	*/
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI | RCC_OSCILLATORTYPE_HSE
	                                   | RCC_OSCILLATORTYPE_LSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
	RCC_OscInitStruct.LSEState = RCC_LSE_ON;
	RCC_OscInitStruct.LSIState = RCC_LSI_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 4;
	RCC_OscInitStruct.PLL.PLLN = freq;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 4;
	RCC_OscInitStruct.PLL.PLLR = 2;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
		StopHier();
	else
	{
		/**Initializes the CPU, AHB and APB busses clocks
		*/
		RCC_ClkInitTypeDef RCC_ClkInitStruct;
		RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
		                              | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
		RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
		RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
		RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
		RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
		
