giopde1ste/dsplab/software/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32412G-Discovery/STM32412gDiscovery.cpp
		if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
			StopHier();
		else
		{
			RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
			
			PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC | RCC_PERIPHCLK_SDIO
			                                           | RCC_PERIPHCLK_CLK48;
			PeriphClkInitStruct.PLLI2S.PLLI2SN = 72;
			PeriphClkInitStruct.PLLI2S.PLLI2SM = 4;
			PeriphClkInitStruct.PLLI2S.PLLI2SR = 2;
			PeriphClkInitStruct.PLLI2S.PLLI2SQ = 3;
			PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
			PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48CLKSOURCE_PLLI2SQ;
			PeriphClkInitStruct.SdioClockSelection = RCC_SDIOCLKSOURCE_CLK48;
			PeriphClkInitStruct.PLLI2SSelection = RCC_PLLI2SCLKSOURCE_PLLSRC;
			if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
				StopHier();
			else
			{
				HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSE, RCC_MCODIV_1);
				
				/**Enables the Clock Security System
				*/
				HAL_RCC_EnableCSS();
				
				/**Configure the Systick interrupt time
				*/
				HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);
				
				/**Configure the Systick
				*/
				HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
				
				/* SysTick_IRQn interrupt configuration */
				HAL_NVIC_SetPriority(SysTick_IRQn, 15, 0);
			}
		}
	}
}

void STM32412gDiscovery::initWaakhond(const UInt16 prescaler,
                                      const UInt16 venster)
{
	waakhond.Init.Prescaler = prescaler;
	waakhond.Init.Reload = venster;
	
	if (HAL_OK != HAL_IWDG_Init(&waakhond))
		StopHier();
	
}

void STM32412gDiscovery::aaiWaakhond()
{
	HAL_IWDG_Refresh(&waakhond);
}

void STM32412gDiscovery::coreReset() const
{
	NVIC_SystemReset();
}

FoutCode STM32412gDiscovery::backupGeheugenOpslaan(const UInt16 adres, const UInt32 waarde)
{
	assert(adres<20);
	auto retkode = FoutCode::Onbekend;
	
	if (false == (adres<20))
		retkode = FoutCode::Fout;
	else
	{
		const auto hwAdres = (RTC_BKP_DR0 + adres);
		HAL_RTCEx_BKUPWrite(&hrtc, hwAdres, waarde);
		retkode = FoutCode::Ok;
	}
	return(retkode);
}

UInt32 STM32412gDiscovery::backupGeheugenLezen(const UInt16 adres)
{
	assert(adres<20);
	
	UInt32 waarde = 0;
	
	
	if (true == (adres<20))
	{
		const auto hwAdres = (RTC_BKP_DR0 + adres);
		waarde = HAL_RTCEx_BKUPRead(&hrtc,hwAdres);
	}
	
	return(waarde);
}

UInt32 STM32412gDiscovery::revEndianess(const UInt32 value) const
{
	UInt32 result;
	__ASM volatile ("rev %0, %1" : "=r" (result) : "r" (value) );
	return(result);
}

void  STM32412gDiscovery::ledsInit()
{
	GPIO_InitTypeDef  GPIO_InitStruct;
	
	/* -1- Enable GPIO Clock (to be able to program the configuration registers) */
	LEDx_GPIO_CLK_ENABLE();
	
	/* -2- Configure IO in output push-pull mode to drive external LEDs */
	GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull  = GPIO_PULLUP;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	
	GPIO_InitStruct.Pin = LED1_PIN + LED2_PIN + LED3_PIN + LED4_PIN;
	HAL_GPIO_Init(LEDx_GPIO_PORT, &GPIO_InitStruct);
	
	BSP_LED_Off(LED1);
	BSP_LED_Off(LED2);
	BSP_LED_Off(LED3);
	BSP_LED_Off(LED4);
	
	__HAL_RCC_TIM13_CLK_ENABLE();
	Tim13Handle.Instance = TIM13;
}

void STM32412gDiscovery::eepromInit()
{
	BSP_EEPROM_Init();
}


#define QSPI_BK1_IO3_Pin GPIO_PIN_6
#define QSPI_BK1_IO2_Pin GPIO_PIN_7
#define QSPI_BK1_IO0_Pin GPIO_PIN_8
#define QSPI_BK1_IO1_Pin GPIO_PIN_9

#define QSPI_CLK_Pin GPIO_PIN_2
#define QSPI_CLK_GPIO_Port GPIOB
#define QSPI_BK1_NCS_Pin GPIO_PIN_6
#define QSPI_BK1_NCS_GPIO_Port GPIOG
#define uSD_D0_Pin GPIO_PIN_8
#define uSD_D1_Pin GPIO_PIN_9
#define uSD_D2_Pin GPIO_PIN_10
#define uSD_D3_Pin GPIO_PIN_11
#define uSD_CLK_Pin GPIO_PIN_12
#define uSD_CMD_Pin GPIO_PIN_2
#define uSD_CMD_GPIO_Port GPIOD


void STM32412gDiscovery::gpioInit()
{
	BSP_JOY_Init(JOY_MODE_EXTI);  /* BPS joystick init */
}

void STM32412gDiscovery::qspiInit()
{
	GPIO_InitTypeDef GPIO_InitStruct;
	
	/* Peripheral clock enable */
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOF_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_QSPI_CLK_ENABLE();
	
	/**QUADSPI GPIO Configuration
	PF6     ------> QUADSPI_BK1_IO3
	PF7     ------> QUADSPI_BK1_IO2
	PF8     ------> QUADSPI_BK1_IO0
	PF9     ------> QUADSPI_BK1_IO1
	PB2     ------> QUADSPI_CLK
	PG6     ------> QUADSPI_BK1_NCS
	*/
	GPIO_InitStruct.Pin = QSPI_BK1_IO3_Pin|QSPI_BK1_IO2_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF9_QSPI;
	HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);
	
	GPIO_InitStruct.Pin = QSPI_BK1_IO0_Pin|QSPI_BK1_IO1_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
	HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);
	
	GPIO_InitStruct.Pin = QSPI_CLK_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF9_QSPI;
	HAL_GPIO_Init(QSPI_CLK_GPIO_Port, &GPIO_InitStruct);
	
	GPIO_InitStruct.Pin = QSPI_BK1_NCS_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
	HAL_GPIO_Init(QSPI_BK1_NCS_GPIO_Port, &GPIO_InitStruct);
	
	hqspi.Instance = QUADSPI;
	hqspi.Init.ClockPrescaler = 0;
	hqspi.Init.FifoThreshold = 4;
	hqspi.Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;
	hqspi.Init.FlashSize = 23;
	hqspi.Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_1_CYCLE;
	hqspi.Init.ClockMode = QSPI_CLOCK_MODE_0;
	hqspi.Init.FlashID = QSPI_FLASH_ID_1;
	hqspi.Init.DualFlash = QSPI_DUALFLASH_DISABLE;
	if (HAL_QSPI_Init(&hqspi) != HAL_OK)
		StopHier();
	else
	{
		/* flash verder nog uitwerken :
		 * dma conflict met usart6 dma2 stream 7 request */
		BSP_QSPI_Init();
	}
}

void STM32412gDiscovery::rngInit()
{
	/* Peripheral clock enable */
	__HAL_RCC_RNG_CLK_ENABLE();
	
	hrng.Instance = RNG;
	if (HAL_RNG_Init(&hrng) != HAL_OK)
		StopHier();
}

void STM32412gDiscovery::sdioInit()
{
	GPIO_InitTypeDef GPIO_InitStruct;
	
	/* Peripheral clock enable */
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_SDIO_CLK_ENABLE();
	__HAL_RCC_DMA2_CLK_ENABLE();
	
	/**SDIO GPIO Configuration
	PC8     ------> SDIO_D0
	PC9     ------> SDIO_D1
	PC10     ------> SDIO_D2
	PC11     ------> SDIO_D3
	PC12     ------> SDIO_CK
	PD2     ------> SDIO_CMD
	*/
	GPIO_InitStruct.Pin = uSD_D0_Pin | uSD_D1_Pin | uSD_D2_Pin | uSD_D3_Pin
	                      | uSD_CLK_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF12_SDIO;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	
	GPIO_InitStruct.Pin = uSD_CMD_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF12_SDIO;
	HAL_GPIO_Init(uSD_CMD_GPIO_Port, &GPIO_InitStruct);
	
	/* Peripheral DMA start*/
	hdma_sdio_rx.Instance = DMA2_Stream3;
	hdma_sdio_rx.Init.Channel = DMA_CHANNEL_4;
	hdma_sdio_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
	hdma_sdio_rx.Init.PeriphInc = DMA_PINC_DISABLE;
	hdma_sdio_rx.Init.MemInc = DMA_MINC_ENABLE;
	hdma_sdio_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
	hdma_sdio_rx.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
	hdma_sdio_rx.Init.Mode = DMA_PFCTRL;
	hdma_sdio_rx.Init.Priority = DMA_PRIORITY_MEDIUM;
	hdma_sdio_rx.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
	hdma_sdio_rx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
	hdma_sdio_rx.Init.MemBurst = DMA_MBURST_INC4;
	hdma_sdio_rx.Init.PeriphBurst = DMA_PBURST_INC4;
	if (HAL_DMA_Init(&hdma_sdio_rx) != HAL_OK)
		StopHier();
	else
	{
		__HAL_LINKDMA(&hsd, hdmarx, hdma_sdio_rx);
		
		/* DMA2_Stream3_IRQn interrupt configuration */
		HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, 10, 0);
		HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);
		
