giopde1ste/dsplab/software/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32412G-Discovery/STM32412gDiscovery.cpp
		hdma_sdio_tx.Instance = DMA2_Stream6;
		hdma_sdio_tx.Init.Channel = DMA_CHANNEL_4;
		hdma_sdio_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
		hdma_sdio_tx.Init.PeriphInc = DMA_PINC_DISABLE;
		hdma_sdio_tx.Init.MemInc = DMA_MINC_ENABLE;
		hdma_sdio_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
		hdma_sdio_tx.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
		hdma_sdio_tx.Init.Mode = DMA_PFCTRL;
		hdma_sdio_tx.Init.Priority = DMA_PRIORITY_LOW;
		hdma_sdio_tx.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
		hdma_sdio_tx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
		hdma_sdio_tx.Init.MemBurst = DMA_MBURST_INC4;
		hdma_sdio_tx.Init.PeriphBurst = DMA_PBURST_INC4;
		if (HAL_DMA_Init(&hdma_sdio_tx) != HAL_OK)
			StopHier();
		else
		{
			__HAL_LINKDMA(&hsd, hdmatx, hdma_sdio_tx);
			
			/* DMA2_Stream6_IRQn interrupt configuration */
			HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, 11, 0);
			HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);
			
			hsd.Instance = SDIO;
			hsd.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
			hsd.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
			hsd.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
			hsd.Init.BusWide = SDIO_BUS_WIDE_1B;
			hsd.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
			hsd.Init.ClockDiv = 0;
			
			if (HAL_SD_Init(&hsd) != HAL_OK)
				StopHier();
			else
				HAL_SD_ConfigWideBusOperation(&hsd, SDIO_BUS_WIDE_4B);
		}
	}
}

void STM32412gDiscovery::rtcInit()
{
	__HAL_RCC_RTC_ENABLE();
	
	/**Initialize RTC Only
	 */
	hrtc.Instance = RTC;
	hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
	hrtc.Init.AsynchPrediv = 127;
	hrtc.Init.SynchPrediv = 255;
	hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
	if (HAL_RTC_Init(&hrtc) != HAL_OK)
		StopHier();
}

TIM_HandleTypeDef STM32412gDiscovery::Tim14Handle;

HAL_StatusTypeDef STM32412gDiscovery::HAL_InitTick(uint32_t TickPriority)
{
	RCC_ClkInitTypeDef    clkconfig;
	uint32_t              uwTimclock = 0;
	uint32_t              uwPrescalerValue = 0;
	uint32_t              pFLatency;
	
	
	
	/* Enable TIM14 clock */
	__HAL_RCC_TIM14_CLK_ENABLE();
	
	/* Get clock configuration */
	HAL_RCC_GetClockConfig(&clkconfig, &pFLatency);
	
	/* Compute TIM14 clock */
	uwTimclock = 2*HAL_RCC_GetPCLK1Freq();
	
	/* Compute the prescaler value to have TIM14 counter clock equal to 1MHz */
	uwPrescalerValue = (uint32_t) ((uwTimclock / 1000000) - 1);
	
	/* Initialize TIM14 */
	Tim14Handle.Instance = TIM14;
	
	/* Initialize TIMx peripheral as follow:
	+ Period = [(TIM14CLK/1000) - 1]. to have a (1/1000) s time base.
	+ Prescaler = (uwTimclock/1000000 - 1) to have a 1MHz counter clock.
	+ ClockDivision = 0
	+ Counter direction = Up
	*/
	auto &handel = Tim14Handle.Init;
	handel.Period = (1000000 / 1000) - 1;
	handel.Prescaler = uwPrescalerValue;
	handel.ClockDivision = 0;
	handel.CounterMode = TIM_COUNTERMODE_UP;

#ifndef NDEBUG
	const auto status = HAL_TIM_Base_Init(&Tim14Handle);
	assert(HAL_OK == status);
#else
	HAL_TIM_Base_Init(&Tim14Handle);
#endif
	
	/*Configure the TIM14 IRQ priority */
	HAL_NVIC_SetPriority(TIM8_TRG_COM_TIM14_IRQn, TickPriority ,4);
	/* Enable the TIM14 global Interrupt */
	HAL_NVIC_EnableIRQ(TIM8_TRG_COM_TIM14_IRQn);
	
	/* Start the TIM time Base generation in interrupt mode */
	return HAL_TIM_Base_Start_IT(&Tim14Handle);
	
}

/**
  * @brief  Suspend Tick increment.
  * @note   Disable the tick increment by disabling TIM14 update interrupt.
  * @param  None
  * @retval None
  */
void HAL_SuspendTick(void)
{
	/* Disable TIM14 update Interrupt */
	__HAL_TIM_DISABLE_IT(&STM32412gDiscovery::Tim14Handle, TIM_IT_UPDATE);
}

/**
  * @brief  Resume Tick increment.
  * @note   Enable the tick increment by Enabling TIM14 update interrupt.
  * @param  None
  * @retval None
  */
void HAL_ResumeTick(void)
{
	/* Enable TIM14 Update interrupt */
	__HAL_TIM_ENABLE_IT(&STM32412gDiscovery::Tim14Handle, TIM_IT_UPDATE);
}

#ifdef FreeRTOSGebruikt

CountingSemaphore STM32412gDiscovery::knopSems[static_cast<Teller>(KnopID::AantalKnoppen)];

void STM32412gDiscovery::isrSemafoorAfhandeling(CountingSemaphore &sem)
{
	BaseType_t nieuwePrio;
	const bool wakkerGeworden = sem.GiveFromISR(&nieuwePrio);
	if (true == wakkerGeworden)
		portYIELD_FROM_ISR(nieuwePrio);
}



#endif

DMA_HandleTypeDef STM32412gDiscovery::hdma_sdio_tx;
DMA_HandleTypeDef STM32412gDiscovery::hdma_sdio_rx;

/* C++ name mangling mag niet de interrupt handler namen veranderen, 
 * deze staan in een assembly bestand zo genoemd.
 * Derhalve hieronder met C-Linking compileren.
 */
#ifdef __cplusplus
extern "C" {
#endif
/******************************************************************************
  Cortex-M3 Processor Exceptions Handlers
******************************************************************************/

// ----------------------------------------------------------------------------
// This function handles NMI exception.
// ----------------------------------------------------------------------------
void NMI_Handler(void)
{
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Hard Fault exception.
// ----------------------------------------------------------------------------
void HardFault_Handler(void)
{
	// Go to infinite loop when Hard Fault exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Memory Manage exception.
// ----------------------------------------------------------------------------
void MemManage_Handler(void)
{
	// Go to infinite loop when Memory Manage exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Bus Fault exception.
// ----------------------------------------------------------------------------
void BusFault_Handler(void)
{
	// Go to infinite loop when Bus Fault exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Usage Fault exception.
// ----------------------------------------------------------------------------
void UsageFault_Handler(void)
{
	// Go to infinite loop when Usage Fault exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles SVCall exception.
// ----------------------------------------------------------------------------
ZWAKGEPLAATST void SVC_Handler(void)
{
}

// ----------------------------------------------------------------------------
// This function handles Debug Monitor exception.
// ----------------------------------------------------------------------------
void DebugMon_Handler(void)
{
}

// ----------------------------------------------------------------------------
// This function handles PendSV_Handler exception.
// ----------------------------------------------------------------------------
ZWAKGEPLAATST void PendSV_Handler(void)
{
}

/**
  * @brief  This function handles SysTick Handler.
  * @param  None
  * @retval None
  */
ZWAKGEPLAATST void SysTick_Handler(void)
{
	HAL_SYSTICK_IRQHandler();
}

