giopde1ste/dsplab/software/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32412G-Discovery/STM32412gDiscovery.cpp
void EXTI0_IRQHandler(void)
{
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
	
	const auto pretstaat =  BSP_JOY_GetState();

#ifndef FreeRTOSGebruikt
	if (JOY_SEL == pretstaat)
		STM32412gDiscovery::knopGedrukt(STM32412gDiscovery::KnopID::Centrum);
	else
		STM32412gDiscovery::knopGedrukt(STM32412gDiscovery::KnopID::Boven);
#else
	static const Teller knop = static_cast<Teller>((JOY_SEL == pretstaat) ? STM32412gDiscovery::KnopID::Centrum :
	                                               STM32412gDiscovery::KnopID::Boven);
	CountingSemaphore &sem = STM32412gDiscovery::knopSems[knop];
	STM32412gDiscovery::isrSemafoorAfhandeling(sem);

#endif
}

/* Knop DOWN druk interrupt */
void EXTI1_IRQHandler(void)
{
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_1);
#ifndef FreeRTOSGebruikt
	STM32412gDiscovery::knopGedrukt(STM32412gDiscovery::KnopID::Onder);
#else
	static Teller knop = static_cast<Teller>(STM32412gDiscovery::KnopID::Onder);
	CountingSemaphore &sem = STM32412gDiscovery::knopSems[knop];
	STM32412gDiscovery::isrSemafoorAfhandeling(sem);

#endif

}

/* links of rechts ingedrukt */
void EXTI15_10_IRQHandler(void)
{

#ifndef FreeRTOSGebruikt
	if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_14) != RESET)
	{
		HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_14);
		STM32412gDiscovery::knopGedrukt(STM32412gDiscovery::KnopID::Rechts);
	}

	if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_15) != RESET)
	{
		HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_15);
		STM32412gDiscovery::knopGedrukt(STM32412gDiscovery::KnopID::Links);
	}
#else
	if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_14) != RESET)
	{
		HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_14);
		static constexpr auto knop = static_cast<Teller>(STM32412gDiscovery::KnopID::Rechts);
		static constexpr auto &sem = STM32412gDiscovery::knopSems[knop];
		STM32412gDiscovery::isrSemafoorAfhandeling(sem);
	}
	
	if (__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_15) != RESET)
	{
		HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_15);
		static constexpr auto knop = static_cast<Teller>(STM32412gDiscovery::KnopID::Links);
		static constexpr auto &sem = STM32412gDiscovery::knopSems[knop];
		STM32412gDiscovery::isrSemafoorAfhandeling(sem);
	}

#endif
}


void TIM8_BRK_TIM12_IRQHandler(void)
{
	/* wacht timer */
	HAL_TIM_IRQHandler(&(STM32412gDiscovery::Tim12Handle));
	
	STM32412gDiscovery::timer2IsAfgelopen();
}

void TIM8_UP_TIM13_IRQHandler(void)
{
	/* blauwe led knipper */
	HAL_TIM_IRQHandler(&(STM32412gDiscovery::Tim13Handle));
	BSP_LED_Toggle(LED4);
}



void TIM8_TRG_COM_TIM14_IRQHandler(void)
{
	/**
     * @brief This function handles TIM8 trigger and commutation interrupts and TIM14 global interrupt.
     * Deze funktie wordt gebruikt voor de HAL Tick funktie.
     */
	
	/* USER CODE BEGIN TIM8_TRG_COM_TIM14_IRQn 0 */
	
	/* USER CODE END TIM8_TRG_COM_TIM14_IRQn 0 */
	HAL_TIM_IRQHandler(&(STM32412gDiscovery::Tim14Handle));
	HAL_IncTick();
	/* USER CODE BEGIN TIM8_TRG_COM_TIM14_IRQn 1 */
	
	/* USER CODE END TIM8_TRG_COM_TIM14_IRQn 1 */
}



/**
* @brief This function handles DMA2 stream3 global interrupt.
*/
void DMA2_Stream3_IRQHandler(void)
{
	/* USER CODE BEGIN DMA2_Stream3_IRQn 0 */
	
	/* USER CODE END DMA2_Stream3_IRQn 0 */
	HAL_DMA_IRQHandler(&STM32412gDiscovery::hdma_sdio_rx);
	/* USER CODE BEGIN DMA2_Stream3_IRQn 1 */
	
	/* USER CODE END DMA2_Stream3_IRQn 1 */
}

/**
* @brief This function handles DMA2 stream6 global interrupt.
*/
void DMA2_Stream6_IRQHandler(void)
{
	/* USER CODE BEGIN DMA2_Stream6_IRQn 0 */
	
	/* USER CODE END DMA2_Stream6_IRQn 0 */
	HAL_DMA_IRQHandler(&STM32412gDiscovery::hdma_sdio_tx);
	/* USER CODE BEGIN DMA2_Stream6_IRQn 1 */
	
	/* USER CODE END DMA2_Stream6_IRQn 1 */
}


#ifdef __cplusplus
}
#endif

#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
	/* User can add his own implementation to report the file name and line number,
	   ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	
	StopHier();
}
#endif



/* Disk IO funkties van FatFS koppelen aan QSPI geheugen op board. */
int assign_drives (int, int)
{
	return(0);
}

DSTATUS QSPI_disk_initialize ()
{
	/* gebeurt als in de STM32412gDiscovery klasse */
	return(0);
}

DSTATUS QSPI_disk_status ()
{
	return(0);
}

static const auto BLOCK_SIZE = 512;

DRESULT QSPI_disk_read (BYTE *buff,		/* Data buffer to store read data */
                        DWORD sector,	    /* Sector address (LBA) */
                        UINT count)		/* Number of sectors to read (1..128) */
{
	if ((DWORD)buff & 3)
	{
		DRESULT res = RES_ERROR;
		DWORD scratch[BLOCK_SIZE / 4];
		
		while (count--)
		{
			/* recursie !!! */
			res = QSPI_disk_read(reinterpret_cast<BYTE *>(scratch),
			                     sector++,
			                     1);
			
			if (res != RES_OK) {
				break;
			}
			
			memcpy(buff, scratch, BLOCK_SIZE);
			
			buff += BLOCK_SIZE;
		}
		
		return res;
	}
	
	const auto aantal = BLOCK_SIZE*count;
	const auto adres = (sector<<9);
	const auto ret = BSP_QSPI_Read(buff,adres,aantal);
	//SD_Error Status = SD_OSReadMultiBlocks(buff, sector << 9, BLOCK_SIZE, count);
	return((QSPI_OK == ret) ? RES_OK : RES_ERROR);
}

#if	_READONLY == 0
DRESULT QSPI_disk_write (const BYTE *buff,	/* Data to be written */
                         DWORD sector,		/* Sector address (LBA) */
                         UINT count			/* Number of sectors to write (1..128) */
)
{
	if ((DWORD)buff & 3) {
		DRESULT res=RES_OK;
		DWORD scratch[BLOCK_SIZE / 4];
		
		while (count--) {
			memcpy(scratch, buff, BLOCK_SIZE);
			
			/* recursief !!! */
			res = QSPI_disk_write(reinterpret_cast<BYTE *>(scratch),
			                      sector++, 1);
			
