giopde1ste/dsplab/software/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32412G-Discovery/STM32412gDiscovery.cpp
			if (res != RES_OK)
			{
				break;
			}
			
			buff += BLOCK_SIZE;
		}
		
		return(res);
	}
	const auto aantal = BLOCK_SIZE*count;
	const auto adres = (sector<<9);
	const auto ret = BSP_QSPI_Write(const_cast<UInt8 *>(buff),
	                                adres,aantal);
	
	return((QSPI_OK == ret) ? RES_OK : RES_ERROR);
}

#endif
DRESULT QSPI_disk_ioctl (BYTE, BYTE, void*)
{
	return(RES_OK);
}



/*-----------------------------------------------------------------------*/
/* Get Drive Status                                                      */
/*-----------------------------------------------------------------------*/

DSTATUS disk_status (
	BYTE pdrv		/* Physical drive nmuber to identify the drive */
)
{
	DSTATUS stat=RES_NOTRDY;
	
	switch (pdrv) {
		case DEV_RAM :
			//result = RAM_disk_status();
			
			break;
		
		case DEV_QSPI :
			stat = QSPI_disk_status();
			
			break;
		
		case DEV_MMC :
			//result = MMC_disk_status();
			
			break;
		
		case DEV_USB :
			//result = USB_disk_status();
			
			break;
		
		default:
			StopHier();
			break;
	}
	return (stat);
}



/*-----------------------------------------------------------------------*/
/* Inidialize a Drive                                                    */
/*-----------------------------------------------------------------------*/

DSTATUS disk_initialize (
	BYTE pdrv				/* Physical drive nmuber to identify the drive */
)
{
	DSTATUS stat=STA_NOINIT;
	
	switch (pdrv) {
		case DEV_RAM :
			//result = RAM_disk_initialize();
			
			break;
		
		case DEV_QSPI :
			stat = QSPI_disk_initialize();
			
			break;
		
		case DEV_MMC :
			//result = MMC_disk_initialize();
			
			break;
		
		case DEV_USB :
			//result = USB_disk_initialize();
			
			break;
		
		default:
			StopHier();
			break;
	}
	return(stat);
}



/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/

DRESULT disk_read (
	BYTE pdrv,		/* Physical drive nmuber to identify the drive */
	BYTE *buff,		/* Data buffer to store read data */
	DWORD sector,	/* Start sector in LBA */
	UINT count		/* Number of sectors to read */
)
{
	DRESULT result=RES_NOTRDY;
	
	switch (pdrv) {
		case DEV_RAM :
			// translate the arguments here
			
			//result = RAM_disk_read(buff, sector, count);
			
			break;
		
		case DEV_QSPI :
			// translate the arguments here
			
			result = QSPI_disk_read(buff, sector, count);
			
			break;
		
		case DEV_MMC :
			// translate the arguments here
			
			//result = MMC_disk_read(buff, sector, count);
			
			break;
		
		case DEV_USB :
			// translate the arguments here
			
			//result = USB_disk_read(buff, sector, count);
			
			break;
		
		default:
			StopHier();
			break;
	}
	
	return(result);
}



/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/

DRESULT disk_write (
	BYTE pdrv,			/* Physical drive nmuber to identify the drive */
	const BYTE *buff,	/* Data to be written */
	DWORD sector,		/* Start sector in LBA */
	UINT count			/* Number of sectors to write */
)
{
	DRESULT result = RES_NOTRDY;
	
	switch (pdrv) {
		case DEV_RAM :
			// translate the arguments here
			
			//result = RAM_disk_write(buff, sector, count);
			
			break;
		
		case DEV_QSPI:
			// translate the arguments here
			
			result = QSPI_disk_write(buff, sector, count);
			
			break;
		
		case DEV_MMC :
			// translate the arguments here
			
			//result = MMC_disk_write(buff, sector, count);
			
			// translate the reslut code here
			
			break;
		
		case DEV_USB :
			// translate the arguments here
			
			//result = USB_disk_write(buff, sector, count);
			
			break;
		
		default:
			StopHier();
			break;
	}
	
	return(result);
}



/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/

DRESULT disk_ioctl (
	BYTE pdrv,		/* Physical drive nmuber (0..) */
	BYTE cmd,		/* Control code */
	void *buff		/* Buffer to send/receive control data */
)
{
	DRESULT res=RES_OK;
	
	switch (pdrv)
	{
		case DEV_RAM :
			
			// Process of the command for the RAM drive
			
			return res;
		
		case DEV_MMC :
			
			// Process of the command for the MMC/SD card
			
			return res;
		
		case DEV_USB :
			
			// Process of the command the USB drive
			
			return res;
		
		default:
			StopHier();
			break;
	}
	
	return RES_PARERR;
}
